Тест1/src/Documents/ЭкзаменационныеЛисты/ЭкзаменационныеЛисты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭкзаменационныеЛисты</name>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Учащийся</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонУчащегося</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднийБалл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИспытательногоСрока</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Результаты</name>
    <attributes>
      <name>Тема</name>
      <type>
        <types>CatalogRef.ТемыОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>Прослушал</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Балл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОценки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЭкзамена</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОбучения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещениеПолучено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/CommonModules/РаботаСДокументамиОбучение/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти


#Область ОбработчикиКомандФормы
	
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДатуОкончанияИспытательногоСрокаСотрудника() Экспорт

	///+ГомзМА 01.06.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭкзаменационныеЛисты.Ссылка КАК Ссылка,
		|	ЭкзаменационныеЛисты.ОкончаниеИспытательногоСрока КАК ОкончаниеИспытательногоСрока,
		|	ЭкзаменационныеЛисты.Учащийся КАК Учащийся
		|ИЗ
		|	Документ.ЭкзаменационныеЛисты КАК ЭкзаменационныеЛисты
		|ГДЕ
		|	НЕ ЭкзаменационныеЛисты.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		ДокОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ДатаНачалаРаботы = ПолучитьДатуНачалаРаботыСотрудника(РезультатЗапроса.Учащийся);
		Если ДатаНачалаРаботы <> '00010101' Тогда
			ДокОбъект.ОкончаниеИспытательногоСрока = ДатаНачалаРаботы + 86400 * 90;
			ДокОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	///-ГомзМА 01.06.2023

	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуНачалаРаботыСотрудника(Сотрудник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь КАК СотрудникПользователь,
		|	ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь.Подразделение КАК СотрудникПользовательПодразделение,
		|	ДолжностиСотрудниковСрезПоследних.Регистратор.Город КАК РегистраторГород,
		|	ДолжностиСотрудниковСрезПоследних.Регистратор КАК Регистратор,
		|	ДолжностиСотрудниковСрезПоследних.Регистратор.Дата КАК РегистраторДата
		|ИЗ
		|	РегистрСведений.ДолжностиСотрудников.СрезПоследних КАК ДолжностиСотрудниковСрезПоследних
		|ГДЕ
		|	НЕ ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь.Недействителен
		|	И ДолжностиСотрудниковСрезПоследних.Регистратор ССЫЛКА Документ.КадровыйПриказ
		|	И ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь = &Пользователь
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДолжностиСотрудниковСрезПоследних.Регистратор.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса.РегистраторДата;
	Иначе
		Возврат '00010101';	
	КонецЕсли;

КонецФункции // ПолучитьДатуНачалаРаботыСотрудника(Сотрудник)


#КонецОбласти
